"""
Скрипт отвечает за импорт и вызов ETL-процесса обновления данных справочника кросс номеров в базе данных PostgreSQL.
"""

# ##################################################
# IMPORTS
# ##################################################
from source.core.de.pipeline.update import ETLCrossNumbers


# ##################################################
# MAIN FUNCTION
# ##################################################
if __name__ == '__main__':
    # Создание экземпляра класса ETL-процесса;
    etl_cross_numbers: ETLCrossNumbers = ETLCrossNumbers()
    
    # Запуск ETL-процесса для обновления данных по кросс-номерам в базе данных;
    etl_cross_numbers.run()
